runTestCases/initialCases/4.1_NACA0012_AOA10/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          7168;
        startFace       7048;
    }
    inlet
    {
        type            patch;
        nFaces          112;
        startFace       14216;
    }
    outlet
    {
        type            patch;
        nFaces          64;
        startFace       14328;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          64;
        startFace       14392;
    }
)

// ************************************************************************* //
