runTestCases/initialCases/4.1_NACA0012_AOA10/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "15000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
3584
(
(50.315296 6.2631687e-21 13.467365)
(50.308989 1.1093397e-19 13.46493)
(50.319056 -1.0084068e-20 13.462457)
(50.306304 -4.6419633e-18 13.465374)
(50.308265 0 13.461575)
(50.318568 0 13.456852)
(50.304325 4.651304e-18 13.466551)
(50.301645 2.55392e-19 13.46204)
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            freestreamVelocity;
        freestreamValue uniform (51.2871 0 9.0433);
        value           nonuniform List<vector> 
112
(
(50.308071 2.326916e-21 13.474614)
(50.305762 4.1950393e-20 13.473617)
(50.304804 -1.860664e-18 13.473478)
(50.304021 1.957446e-18 13.473703)
(50.303582 -4.667198e-18 13.474062)
(50.303414 9.3332005e-18 13.474371)
(50.303356 -9.3764174e-18 13.474614)
(50.303303 4.6582955e-18 13.474798)
...
)
;
    }
    outlet
    {
        type            freestreamVelocity;
        freestreamValue uniform (50.3038 0 13.4789);
        value           nonuniform List<vector> 
64
(
(50.299865 -2.0221145e-21 13.447067)
(50.307989 3.0924872e-21 13.453219)
(50.30887 0 13.448262)
(50.311582 0 13.449033)
(50.315963 0 13.450119)
(50.317233 -6.682259e-22 13.45063)
(50.31718 7.3820015e-22 13.450746)
(50.317415 -5.4559713e-25 13.450887)
...
)
;
    }
    wall
    {
        type            noSlip;
    }
}


// ************************************************************************* //
