runTestCases/initialCases/4.1_NACA0012_AOA10/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "15000";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
3584
(
0.16893072
0.45005713
0.11702064
0.60909676
0.44211782
0.13585213
0.69262801
0.79325892
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
        value           nonuniform List<scalar> 
112
(
0.10616895
0.27986513
0.36494912
0.40114375
0.42851865
0.4437606
0.45202407
0.45994602
...
)
;
    }
    outlet
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
        value           nonuniform List<scalar> 
64
(
-0.0018110337
-9.0540612e-05
0.00046996516
0.0012189659
0.0015487429
0.0017198796
0.0018167394
0.0018758289
...
)
;
    }
    wall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
