runTestCases/initialCases/4.1_NACA0012_AOA10/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
3584
(
(414.63042 -0.5 -389.23981)
(272.66895 -0.5 -389.32026)
(414.47595 -0.5 -224.67676)
(184.25476 -0.5 -388.43747)
(271.44502 -0.5 -224.79539)
(414.44269 -0.5 -129.69836)
(134.9997 -0.5 -389.38639)
(178.59141 -0.5 -224.91016)
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
112
(
(414.7782 -0.5 -493.68064)
(273.91768 -0.5 -494.68701)
(189.54101 -0.5 -497.3828)
(145.7837 -0.5 -500.67518)
(124.80649 -0.5 -502.91394)
(113.56276 -0.5 -504.17717)
(105.83497 -0.5 -504.98975)
(99.12946 -0.5 -505.62123)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
64
(
(501.00001 -0.5 389.18513)
(501.00001 -0.5 224.6385)
(501.00001 -0.5 129.6768)
(501.00001 -0.5 74.862686)
(501.00001 -0.5 43.219724)
(501.00001 -0.5 24.952023)
(501.00001 -0.5 14.405665)
(501.00001 -0.5 8.3169257)
...
)
;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<vector> 
64
(
(0.99546207 -0.5 -0.00064011804)
(0.98492263 -0.5 -0.0021158679)
(0.97103899 -0.5 -0.0040302139)
(0.95289877 -0.5 -0.0064822314)
(0.92944811 -0.5 -0.0095725501)
(0.89954577 -0.5 -0.013388858)
(0.86207601 -0.5 -0.017984127)
(0.81613389 -0.5 -0.023348379)
...
)
;
    }
}


// ************************************************************************* //
