runTestCases/initialCases/4.1_NACA0012_AOA10/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    /*
    p
    {
        solver GAMG;
        tolerance 1e-8;
        relTol 1e-3;
        smoother GaussSeidel; 
        nPreSweeps 0;
        nPostSweeps 2;
        cacheAgglomeration on;
        agglomerator faceAreaPair;
        nCellsInCoarsestLevel 1000;
        mergeLevels 1;
    }
    */

   

    p
    {
        solver                  PCG;
        preconditioner          DIC;
        tolerance               1e-8;
        relTol                  0.001;
    }


     "(U|k|epsilon|omega)"
    {
        solver PBiCGStab;
        preconditioner DILU;
        tolerance 1e-8;
        relTol 0.0;
    }


}

SIMPLE
{
    // momentumPredictor           yes;
    // nOuterCorrectors            1;
    // nCorrector                  3;
    nNonOrthogonalCorrectors    0;
    consistent      yes;         // SIMPLEC

    residualControl
    {
        p               1e-8;
        U               1e-8;
        "(k|epsilon|omega)" 1e-8;
    }
}

relaxationFactors
{
    equations
    {
        p               0.3;
        ".*"            0.7;
    }
}

cache
{
    grad(U);
}


// ************************************************************************* //
