runTestCases/initialCases/4.1_NACA0012_AOA10/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    system;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type surfaces;
setFormat raw;
surfaceFormat raw;
interpolationScheme cellPoint;

fields
(
    p
);

surfaces
(
    airfoil_wall
    {
        type            patch;
        patches         ( "wall" );
        // interpolate     true;
        // Optional: whether to leave as faces (=default) or triangulate
        // triangulate     false;
        }
);

// *********************************************************************** //
